math/linear_algebra.org
#+TITLE: Linear Algebra
#+STARTUP: latexpreview

* Vector space

Requirements for a set of entities to form a vector space

1. Closure under commutative and associative addition
2. Closure under multiplication of a scalar
3. The existance of a null vector
4. Multiplication by unity leaves any vector unchanged
5. Each vector has a corresponding negative vector

* Linear equations

** Row-echelon form

1. All zero rows are at the bottom of the matrix
2. If two sucessive rows are non-zero, the second row starts with strictly more zeros than the first

** Reduced row-echelon form
1. It's in row-echelon form
2. The leading left most non-zero entry in each non-zero row is 1
3. All other elements of the column in which the leading entry 1 occurs are zeros

** Row operations

1. Interchanging rows
2. Multiplying row by non-zero scalar
3. Adding a multiple of one row to another row

Preserves row-equivalence

** Gauss-Jordan algorithm / Gaussian elimination

You should know this

** Homogenous equations

"Implicit equations with no non-zero constants"

=A homogenous system of m linear equations in n unknowns always has a non-trivial solution if m < n=

* Matrices
** Inner product

Hilbert space is basically inner product space for finite dimensions

Orthornormal: $\braket{\hat{e}_i}{\hat{e}_j} = \delta_{ij}$ (i.e. orthogonal and normalised)

\begin{aligned}
\braket{a}{b} & = \braket{b}{a}^\ast \\
              & = \sum_i a_i^\ast b_i \text{ (On orthonormal basis)} \\
              & = \sum_{ij} a_i^\ast b_j \braket{\hat{e}_i}{\hat{e}_j} \\
\end{aligned}

** Inequalities and equalities

*** Cauchy-Schwarz's inequality

\[
\vert\braket{a}{b}\vert \leq \Vert a\Vert \Vert b\Vert
\]

In 2d, abcosx <= aba

equality when a is a scalar multiple of b

*** Triangle Inequality

\[
\Vert a+b \Vert \leq \Vert a \Vert + \Vert b \Vert
\]

*** Bessel's inequality


\[
\Vert a \Vert^2 \geq \sum_i \vert \braket{\hat{e}_i}{a} \vert^2
\]
or

\[
\braket{a}{a} \geq \sum_i \vert a_i \vert^2
\]

where $\hat{e}_i$ is an orthonormal basis

where the equality holds if the sum includes all N basis vectors or if remaining basis vectors have
a_i = 0


*** Parallelogram equality

\[
\Vert a + b \Vert^2 + \Vert a - b \Vert^2 = 2(\Vert a \Vert^2 + \Vert b \Vert^2)
\]

** Functions of matrices

\[
\exp A = \sum_{n=0}^\infty \frac{A^n}{n!}
\]

Derivatives exist.


** Operations
*** Transpose

\[
(AB\ldots G)^T = G^T \ldots C^T B^T A^T
\]

*** Hermitian Conjugate (Complex Transpose)

\[
A^\dagger = (A^\ast)^T = (A^T)^\ast
\]

