exports/math/linear_algebra.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-16 Mon 17:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linear Algebra</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Linear Algebra</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdd41964">1. Vector space</a></li>
<li><a href="#org21db95a">2. Linear equations</a>
<ul>
<li><a href="#orged8e3ae">2.1. Row-echelon form</a></li>
<li><a href="#orgd144dd6">2.2. Reduced row-echelon form</a></li>
<li><a href="#orgdf6cad5">2.3. Row operations</a></li>
<li><a href="#org6056e17">2.4. Gauss-Jordan algorithm / Gaussian elimination</a></li>
<li><a href="#org5de4cc5">2.5. Homogenous equations</a></li>
</ul>
</li>
<li><a href="#org26aa64e">3. Matrices</a>
<ul>
<li><a href="#orgfc4fcd9">3.1. Inner product</a></li>
<li><a href="#orgd624515">3.2. Inequalities and equalities</a>
<ul>
<li><a href="#orgdf85d24">3.2.1. Cauchy-Schwarz's inequality</a></li>
<li><a href="#orga17134c">3.2.2. Triangle Inequality</a></li>
<li><a href="#org431f3ae">3.2.3. Bessel's inequality</a></li>
<li><a href="#org0677a01">3.2.4. Parallelogram equality</a></li>
</ul>
</li>
<li><a href="#org2fab0fe">3.3. Functions of matrices</a></li>
<li><a href="#org940f329">3.4. Operations</a>
<ul>
<li><a href="#org3bdf355">3.4.1. Transpose</a></li>
<li><a href="#org89af3c0">3.4.2. Hermitian Conjugate (Complex Transpose)</a></li>
<li><a href="#org62e3173">3.4.3. Trace</a></li>
<li><a href="#orgc2869c0">3.4.4. Determinant</a></li>
<li><a href="#orga43b6be">3.4.5. Inverse</a></li>
<li><a href="#org05a68b1">3.4.6. Rank</a></li>
</ul>
</li>
<li><a href="#orgfb912d4">3.5. Special forms</a>
<ul>
<li><a href="#orga613f8c">3.5.1. Diagonal matrix</a></li>
<li><a href="#org6151834">3.5.2. Lower or upper triangular matrices</a></li>
<li><a href="#orgc164763">3.5.3. Symmetric and antisymmetric matrices</a></li>
<li><a href="#org1490157">3.5.4. Orthogonal matrix</a></li>
<li><a href="#org23e156e">3.5.5. Hermitian matrices (Complex Symmetric)</a></li>
<li><a href="#orgd8f6462">3.5.6. Unitary matrix (complex orthogonal)</a></li>
<li><a href="#orge1d0194">3.5.7. Normal matrices</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgacaaaa1">4. Vectors and spaces</a>
<ul>
<li><a href="#org7ed7f49">4.1. Completeness relation for orthonormal vectors</a>
<ul>
<li><a href="#org77ad4c5">4.1.1. Outer product representation of Unitary U</a></li>
</ul>
</li>
<li><a href="#org692765d">4.2. Projectors</a></li>
</ul>
</li>
<li><a href="#org8cbecec">5. Operators</a>
<ul>
<li><a href="#org5b8e9b7">5.1. Commutator</a></li>
<li><a href="#orge4143b4">5.2. Diagonalisable</a></li>
<li><a href="#org4d9f053">5.3. Active and passive transformations</a></li>
</ul>
</li>
<li><a href="#orgcd69d74">6. Eigenvectors and eigenvalues</a>
<ul>
<li><a href="#org6cb6721">6.1. Normal matrices:</a></li>
<li><a href="#org244d2ea">6.2. Gram-Schmidt orthogonalisation</a></li>
<li><a href="#org4e8058b">6.3. Eigen-everything of Hermitian and anti-hermitian matrices</a></li>
<li><a href="#orgc9af4c0">6.4. Eigen-everything of unitary matrix</a></li>
<li><a href="#orgb5733c4">6.5. Eigen-everything of a general square matrix</a></li>
<li><a href="#org5742db8">6.6. Simultaneous eigenvectors</a></li>
<li><a href="#org92b0bbe">6.7. Determination</a></li>
</ul>
</li>
<li><a href="#org94f6e9b">7. Change in basis</a>
<ul>
<li><a href="#org66f4b5f">7.1. Unitary S</a></li>
</ul>
</li>
<li><a href="#orgc9cb5c6">8. Diagonalisation of matrices</a></li>
<li><a href="#org075087c">9. Infinite dimensions</a>
<ul>
<li><a href="#orgfc7401a">9.1. Dirac delta</a></li>
<li><a href="#org3164eb0">9.2. Operators</a>
<ul>
<li><a href="#orgd361d86">9.2.1. Differential operator</a></li>
<li><a href="#orgde2d273">9.2.2. X basis</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdd41964" class="outline-2">
<h2 id="orgdd41964"><span class="section-number-2">1</span> Vector space</h2>
<div class="outline-text-2" id="text-1">
<p>
Requirements for a set of entities to form a vector space
</p>

<ol class="org-ol">
<li>Closure under commutative and associative addition</li>
<li>Closure under multiplication of a scalar</li>
<li>The existance of a null vector</li>
<li>Multiplication by unity leaves any vector unchanged</li>
<li>Each vector has a corresponding negative vector</li>
</ol>
</div>
</div>

<div id="outline-container-org21db95a" class="outline-2">
<h2 id="org21db95a"><span class="section-number-2">2</span> Linear equations</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orged8e3ae" class="outline-3">
<h3 id="orged8e3ae"><span class="section-number-3">2.1</span> Row-echelon form</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>All zero rows are at the bottom of the matrix</li>
<li>If two sucessive rows are non-zero, the second row starts with strictly more zeros than the first</li>
</ol>
</div>
</div>

<div id="outline-container-orgd144dd6" class="outline-3">
<h3 id="orgd144dd6"><span class="section-number-3">2.2</span> Reduced row-echelon form</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>It's in row-echelon form</li>
<li>The leading left most non-zero entry in each non-zero row is 1</li>
<li>All other elements of the column in which the leading entry 1 occurs are zeros</li>
</ol>
</div>
</div>

<div id="outline-container-orgdf6cad5" class="outline-3">
<h3 id="orgdf6cad5"><span class="section-number-3">2.3</span> Row operations</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Interchanging rows</li>
<li>Multiplying row by non-zero scalar</li>
<li>Adding a multiple of one row to another row</li>
</ol>

<p>
Preserves row-equivalence
</p>
</div>
</div>

<div id="outline-container-org6056e17" class="outline-3">
<h3 id="org6056e17"><span class="section-number-3">2.4</span> Gauss-Jordan algorithm / Gaussian elimination</h3>
<div class="outline-text-3" id="text-2-4">
<p>
You should know this
</p>
</div>
</div>

<div id="outline-container-org5de4cc5" class="outline-3">
<h3 id="org5de4cc5"><span class="section-number-3">2.5</span> Homogenous equations</h3>
<div class="outline-text-3" id="text-2-5">
<p>
"Implicit equations with no non-zero constants"
</p>

<p>
<code>A homogenous system of m linear equations in n unknowns always has a non-trivial solution if m &lt; n</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org26aa64e" class="outline-2">
<h2 id="org26aa64e"><span class="section-number-2">3</span> Matrices</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgfc4fcd9" class="outline-3">
<h3 id="orgfc4fcd9"><span class="section-number-3">3.1</span> Inner product</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Hilbert space is basically inner product space for finite dimensions
</p>

<p>
Orthornormal: \(\braket{\hat{e}_i}{\hat{e}_j} = \delta_{ij}\) (i.e. orthogonal and normalised)
</p>

\begin{aligned}
\braket{a}{b} & = \braket{b}{a}^\ast \\
              & = \sum_i a_i^\ast b_i \text{ (On orthonormal basis)} \\
              & = \sum_{ij} a_i^\ast b_j \braket{\hat{e}_i}{\hat{e}_j} \\
\end{aligned}
</div>
</div>

<div id="outline-container-orgd624515" class="outline-3">
<h3 id="orgd624515"><span class="section-number-3">3.2</span> Inequalities and equalities</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgdf85d24" class="outline-4">
<h4 id="orgdf85d24"><span class="section-number-4">3.2.1</span> Cauchy-Schwarz's inequality</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
\[
\vert\braket{a}{b}\vert \leq \Vert a\Vert \Vert b\Vert
\]
</p>

<p>
In 2d, abcosx &lt;= aba
</p>

<p>
equality when a is a scalar multiple of b
</p>
</div>
</div>

<div id="outline-container-orga17134c" class="outline-4">
<h4 id="orga17134c"><span class="section-number-4">3.2.2</span> Triangle Inequality</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
\[
\Vert a+b \Vert \leq \Vert a \Vert + \Vert b \Vert
\]
</p>
</div>
</div>

<div id="outline-container-org431f3ae" class="outline-4">
<h4 id="org431f3ae"><span class="section-number-4">3.2.3</span> Bessel's inequality</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
\[
\Vert a \Vert^2 \geq \sum_i \vert \braket{\hat{e}_i}{a} \vert^2
\]
or
</p>

<p>
\[
\braket{a}{a} \geq \sum_i \vert a_i \vert^2
\]
</p>

<p>
where \(\hat{e}_i\) is an orthonormal basis
</p>

<p>
where the equality holds if the sum includes all N basis vectors or if remaining basis vectors have
a<sub>i</sub> = 0
</p>
</div>
</div>


<div id="outline-container-org0677a01" class="outline-4">
<h4 id="org0677a01"><span class="section-number-4">3.2.4</span> Parallelogram equality</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
\[
\Vert a + b \Vert^2 + \Vert a - b \Vert^2 = 2(\Vert a \Vert^2 + \Vert b \Vert^2)
\]
</p>
</div>
</div>
</div>

<div id="outline-container-org2fab0fe" class="outline-3">
<h3 id="org2fab0fe"><span class="section-number-3">3.3</span> Functions of matrices</h3>
<div class="outline-text-3" id="text-3-3">
<p>
\[
\exp A = \sum_{n=0}^\infty \frac{A^n}{n!}
\]
</p>

<p>
Derivatives exist.
</p>
</div>
</div>


<div id="outline-container-org940f329" class="outline-3">
<h3 id="org940f329"><span class="section-number-3">3.4</span> Operations</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org3bdf355" class="outline-4">
<h4 id="org3bdf355"><span class="section-number-4">3.4.1</span> Transpose</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
\[
(AB\ldots G)^T = G^T \ldots C^T B^T A^T
\]
</p>
</div>
</div>

<div id="outline-container-org89af3c0" class="outline-4">
<h4 id="org89af3c0"><span class="section-number-4">3.4.2</span> Hermitian Conjugate (Complex Transpose)</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
\[
A^\dagger = (A^\ast)^T = (A^T)^\ast
\]
</p>
</div>
</div>
