math/linear_algebra.org
*** Trace

\[
\Tr A = \sum_i A_{ii}
\]

\[
\Tr ABC = \Tr BCA = \Tr CAB
\]

(Invariant under cyclic permutations)

\[
\Tr \Omega = \Tr U^\dagger \Omega U
\]

*** Determinant

Minor:

$M_{ij}$ = determinant of matrix obtained by removing row i and column j

Cofactor:

$C_{ij} = (-1)^{i+j} M_{ij}$


Thus a determinant is the sum of the products of the elements along any row or column and their corresponding cofactors

e.g.

\[
\sum_i A_{1i}C_{1i}
\]

**** Properties

1. $\vert A^T \vert = \vert A \vert$

2. If rows of A are interchanged, its determinant changes sign but is unaltered in magnitude

3. if all the elements of a row or column of A have a common factor, it can be factored out. Also, $\vert \lambda A \vert = \lambda^N \vert A \vert$

4. If any two rows are identical or multiples of one another, det is 0

5. Determinant is unchanged by adding to the elements of one row any fixed multiple of the elements of another row

6. Determinant of the product of multiple matrices is invariant under permutations of the matrices

\[
\vert A \vert = a \cdot (b \times c)
\]

$\vert A^{-1} \vert = \vert A \vert^{-1}$

\[
\det \Omega = \det U^\dagger \Omega U
\]

*** Inverse

Exists when determinant is not zero, i.e. the matrix is non-singular


\[
(A^{-1})_{ik} = \frac{C_{ki}}{\vert A \vert}
\]

\[
(ABC)^{-1} = C^{-1}B^{-1}A^{-1}
\]

A diagonally dominant matrices are invertible/non-singular

*** Rank

R(A) = R(A^T) = number of linearly independent vectors row-wise or column-wise

or

Size of the largest square submatrix of A whose determinant is non-zero

** Special forms

*** Diagonal matrix

Having non-zero elements only on the leading diagonal

Also denoted by e.g. A = diag(1,2,-3)

\[
\vert A \vert = \prod_i A_{ii}
\]

\[
A^{-1} = \text{diag} (\frac{1}{A_{11}},\frac{1}{A_{22}}, \ldots)
\]


if A and B are diagonal, their product is commutative

*** Lower or upper triangular matrices


\[
\vert A \vert = \prod_i A_{ii}
\]

*** Symmetric and antisymmetric matrices

Symmetric:

\[
A = A^T
\]

Anti/Skew-symmetric:

\[
A = -A^T
\]


Any matrix can be written as a sum of a symmetric and an antisymmetric matrix

\[
A = \frac12 (A + A^T) + \frac12 (A - A^T)
\]

Note that if A is an NxN antisymmetric matrix, |A| = 0 if N is odd

*** Orthogonal matrix

\[
A^T = A^{-1}
\]

\[
\vert A \vert = \pm 1
\]

*** Hermitian matrices (Complex Symmetric)

Hermitian

\[
A = A^\dagger
\]

Anti-Hermitian

\[
A = -A^\dagger
\]

\[
A = \frac12 (A+A^\dagger) + \frac12(A-A^\dagger)
\]

*** Unitary matrix (complex orthogonal)

\[
A^\dagger = A^{-1}
\]


The determinant and eigenvalues of a unitary matrix have unit modulus

It also represents a linear operator which leaves the norms (inner products) of complex vectors unchanged (i.e. orthonormal-ness)

An operator is unitary iff each of its matrix representations are unitary

The rows may be interpreted as components of n orthonormal vectors similar to how columns are components of n vectors.

*** Normal matrices

\[
AA^\dagger = A^\dagger A
\]

Hermitian matrices and unitary matrices are normal

A Normal matrix is hermitian iff it has real eigenvalues

* Vectors and spaces
** Completeness relation for orthonormal vectors

\[
\sum_i \ket{i}\bra{i} = I
\]

where |i> is any orthonormal basis for the vector space V

Which allows us to represent any operator in the outer product notation.
Given A : V $\rightarrow$ W, and |v_i> and |w_j> are orthornormal bases for V and W


\begin{aligned}
A & = I_W A I_V \\
  & = \sum_{ij} \bra{w_j}A\ket{v_i} \ket{w_j} \bra{v_i}
\end{aligned}

*** Outer product representation of Unitary U
Define:

\[
\ket{w_i} \equiv U\ket{v_i}
\]

Note that that implies:

\[
U = \sum_i \ket{w_i} \bra{v_i}
\]

And that if |v_i> and |w_i> are any orthonormal bases, then U defined above is also unitary

