exports/math/linear_algebra.html

<div id="outline-container-org62e3173" class="outline-4">
<h4 id="org62e3173"><span class="section-number-4">3.4.3</span> Trace</h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
\[
\Tr A = \sum_i A_{ii}
\]
</p>

<p>
\[
\Tr ABC = \Tr BCA = \Tr CAB
\]
</p>

<p>
(Invariant under cyclic permutations)
</p>

<p>
\[
\Tr \Omega = \Tr U^\dagger \Omega U
\]
</p>
</div>
</div>

<div id="outline-container-orgc2869c0" class="outline-4">
<h4 id="orgc2869c0"><span class="section-number-4">3.4.4</span> Determinant</h4>
<div class="outline-text-4" id="text-3-4-4">
<p>
Minor:
</p>

<p>
\(M_{ij}\) = determinant of matrix obtained by removing row i and column j
</p>

<p>
Cofactor:
</p>

<p>
\(C_{ij} = (-1)^{i+j} M_{ij}\)
</p>


<p>
Thus a determinant is the sum of the products of the elements along any row or column and their corresponding cofactors
</p>

<p>
e.g.
</p>

<p>
\[
\sum_i A_{1i}C_{1i}
\]
</p>
</div>

<ol class="org-ol">
<li><a id="org8833a98"></a>Properties<br />
<div class="outline-text-5" id="text-3-4-4-1">
<ol class="org-ol">
<li>\(\vert A^T \vert = \vert A \vert\)</li>

<li>If rows of A are interchanged, its determinant changes sign but is unaltered in magnitude</li>

<li>if all the elements of a row or column of A have a common factor, it can be factored out. Also, \(\vert \lambda A \vert = \lambda^N \vert A \vert\)</li>

<li>If any two rows are identical or multiples of one another, det is 0</li>

<li>Determinant is unchanged by adding to the elements of one row any fixed multiple of the elements of another row</li>

<li>Determinant of the product of multiple matrices is invariant under permutations of the matrices</li>
</ol>

<p>
\[
\vert A \vert = a \cdot (b \times c)
\]
</p>

<p>
\(\vert A^{-1} \vert = \vert A \vert^{-1}\)
</p>

<p>
\[
\det \Omega = \det U^\dagger \Omega U
\]
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orga43b6be" class="outline-4">
<h4 id="orga43b6be"><span class="section-number-4">3.4.5</span> Inverse</h4>
<div class="outline-text-4" id="text-3-4-5">
<p>
Exists when determinant is not zero, i.e. the matrix is non-singular
</p>


<p>
\[
(A^{-1})_{ik} = \frac{C_{ki}}{\vert A \vert}
\]
</p>

<p>
\[
(ABC)^{-1} = C^{-1}B^{-1}A^{-1}
\]
</p>

<p>
A diagonally dominant matrices are invertible/non-singular
</p>
</div>
</div>

<div id="outline-container-org05a68b1" class="outline-4">
<h4 id="org05a68b1"><span class="section-number-4">3.4.6</span> Rank</h4>
<div class="outline-text-4" id="text-3-4-6">
<p>
R(A) = R(A<sup>T</sup>) = number of linearly independent vectors row-wise or column-wise
</p>

<p>
or
</p>

<p>
Size of the largest square submatrix of A whose determinant is non-zero
</p>
</div>
</div>
</div>

<div id="outline-container-orgfb912d4" class="outline-3">
<h3 id="orgfb912d4"><span class="section-number-3">3.5</span> Special forms</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-orga613f8c" class="outline-4">
<h4 id="orga613f8c"><span class="section-number-4">3.5.1</span> Diagonal matrix</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Having non-zero elements only on the leading diagonal
</p>

<p>
Also denoted by e.g. A = diag(1,2,-3)
</p>

<p>
\[
\vert A \vert = \prod_i A_{ii}
\]
</p>

<p>
\[
A^{-1} = \text{diag} (\frac{1}{A_{11}},\frac{1}{A_{22}}, \ldots)
\]
</p>


<p>
if A and B are diagonal, their product is commutative
</p>
</div>
</div>

<div id="outline-container-org6151834" class="outline-4">
<h4 id="org6151834"><span class="section-number-4">3.5.2</span> Lower or upper triangular matrices</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
\[
\vert A \vert = \prod_i A_{ii}
\]
</p>
</div>
</div>

<div id="outline-container-orgc164763" class="outline-4">
<h4 id="orgc164763"><span class="section-number-4">3.5.3</span> Symmetric and antisymmetric matrices</h4>
<div class="outline-text-4" id="text-3-5-3">
<p>
Symmetric:
</p>

<p>
\[
A = A^T
\]
</p>

<p>
Anti/Skew-symmetric:
</p>

<p>
\[
A = -A^T
\]
</p>


<p>
Any matrix can be written as a sum of a symmetric and an antisymmetric matrix
</p>

<p>
\[
A = \frac12 (A + A^T) + \frac12 (A - A^T)
\]
</p>

<p>
Note that if A is an NxN antisymmetric matrix, |A| = 0 if N is odd
</p>
</div>
</div>

<div id="outline-container-org1490157" class="outline-4">
<h4 id="org1490157"><span class="section-number-4">3.5.4</span> Orthogonal matrix</h4>
<div class="outline-text-4" id="text-3-5-4">
<p>
\[
A^T = A^{-1}
\]
</p>

<p>
\[
\vert A \vert = \pm 1
\]
</p>
</div>
</div>

<div id="outline-container-org23e156e" class="outline-4">
<h4 id="org23e156e"><span class="section-number-4">3.5.5</span> Hermitian matrices (Complex Symmetric)</h4>
<div class="outline-text-4" id="text-3-5-5">
<p>
Hermitian
</p>

<p>
\[
A = A^\dagger
\]
</p>

<p>
Anti-Hermitian
</p>

<p>
\[
A = -A^\dagger
\]
</p>

<p>
\[
A = \frac12 (A+A^\dagger) + \frac12(A-A^\dagger)
\]
</p>
</div>
</div>

<div id="outline-container-orgd8f6462" class="outline-4">
<h4 id="orgd8f6462"><span class="section-number-4">3.5.6</span> Unitary matrix (complex orthogonal)</h4>
<div class="outline-text-4" id="text-3-5-6">
<p>
\[
A^\dagger = A^{-1}
\]
</p>


<p>
The determinant and eigenvalues of a unitary matrix have unit modulus
</p>

<p>
It also represents a linear operator which leaves the norms (inner products) of complex vectors unchanged (i.e. orthonormal-ness)
</p>

<p>
An operator is unitary iff each of its matrix representations are unitary
</p>

<p>
The rows may be interpreted as components of n orthonormal vectors similar to how columns are components of n vectors.
</p>
</div>
</div>

<div id="outline-container-orge1d0194" class="outline-4">
<h4 id="orge1d0194"><span class="section-number-4">3.5.7</span> Normal matrices</h4>
<div class="outline-text-4" id="text-3-5-7">
<p>
\[
AA^\dagger = A^\dagger A
\]
</p>

<p>
Hermitian matrices and unitary matrices are normal
</p>

<p>
A Normal matrix is hermitian iff it has real eigenvalues
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgacaaaa1" class="outline-2">
<h2 id="orgacaaaa1"><span class="section-number-2">4</span> Vectors and spaces</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org7ed7f49" class="outline-3">
<h3 id="org7ed7f49"><span class="section-number-3">4.1</span> Completeness relation for orthonormal vectors</h3>
<div class="outline-text-3" id="text-4-1">
<p>
\[
\sum_i \ket{i}\bra{i} = I
\]
</p>

<p>
where |i&gt; is any orthonormal basis for the vector space V
</p>

<p>
Which allows us to represent any operator in the outer product notation.
Given A : V \(\rightarrow\) W, and |v<sub>i</sub>&gt; and |w<sub>j</sub>&gt; are orthornormal bases for V and W
</p>


\begin{aligned}
A & = I_W A I_V \\
  & = \sum_{ij} \bra{w_j}A\ket{v_i} \ket{w_j} \bra{v_i}
\end{aligned}
</div>

<div id="outline-container-org77ad4c5" class="outline-4">
<h4 id="org77ad4c5"><span class="section-number-4">4.1.1</span> Outer product representation of Unitary U</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Define:
</p>

<p>
\[
\ket{w_i} \equiv U\ket{v_i}
\]
</p>

<p>
Note that that implies:
</p>

<p>
\[
U = \sum_i \ket{w_i} \bra{v_i}
\]
</p>

<p>
And that if |v<sub>i</sub>&gt; and |w<sub>i</sub>&gt; are any orthonormal bases, then U defined above is also unitary
</p>
</div>
</div>
</div>
