math/linear_algebra.org
** Projectors
A class of Hermitian operators. Let W be a k-dimensional vector subspace of the d-dimensional vector space V. Using Gram-Schmidt procedure it is possible to construct an orthonormal basisc for V (|1>,...,|d>)such that |1>,...,|k> is an orthonormal basis for W. The projector by defintion:

\[
P \equiv \sum_{i=k}^k \ket{i} \bra{i}
\]

\[
(P_i)_{kl} = \delta_{kl}\delta_{li}
\]

The orthogonal complement of P is Q = I - P, which is a projector onto the vector space spanned by |k+1>...|d>

\[
P_i P_j = \delta_{ij} P_j
\]

Note that P^2 = P

* Operators
** Commutator

Definition:

\[
\Omega \Lambda - \Lambda\Omega \equiv [\Omega,\Lambda]
\]

Identities:

\[
[\Omega,\Lambda] = \Lambda[\Omega,\theta] + [\Omega,\Lambda]\theta
\]

\[
[\Lambda\Omega,\theta] = \Lambda[\Omega,\theta] + [\Lambda,\theta]\Omega
\]

** Diagonalisable

A diagonal representation for an operator A on vector space V is a representation:

\[
A = \sum_i \lambda_i \ket{i}\bra{i}
\]
with corresponding eigenvalues $\lambda_i$

An operator is diagonalisable is it has a diagonal representation.

Any normal operator M on a vector space V is diagonal wrt some orthonormal basis for V. Also any diagonalisable operator is normal

** Active and passive transformations
If all vectors in a space are subject to a unitary transform (*Active Transformation*)

\[
\ket{V} \to U\ket{V}
\]
Then the same change would be effected if subjected operators to the change (*Passive Transformation*)
\[
\Omega \to U^\dagger\Omega U
\]

* Eigenvectors and eigenvalues


\[
Ax = \lambda x
\]


\[
A^{-1}x^i = \frac{1}{\lambda_i}x_i
\]

The eigenspace corresponding to a eigenvalue v is the set of vectors with eigenvalue v

** Normal matrices:

\[
A^\dagger x^i = \lambda_i^\ast x^i
\]

If $\lambda_i \neq \lambda_j$, the eigenvectors $x^i$ and $x^j$ must be orthogonal


An eigenvalue corresponding to two or more different eigenvectors (i.e. they are not multiples) are *degenerate*. or in other words the *eigenspace* has more than 1 dimensions

Suppose $\lambda_1$ is k-fold degenerate (for x^1 to x^k), then any linear combination of those x^1 also has an eigenvalue of $\lambda_1$


** Gram-Schmidt orthogonalisation

\begin{aligned}
z^1 & = x^1, \\
z^2 & = x^2 - \braket{\hat{z}^1}{x^2} \hat{z}^1, \\
z^3 & = x^3 - \braket{\hat{z}^2}{x^3} \hat{z}^2 - \braket{\hat{z}^1}{x^3} \hat{z}^1, \\
 & \ldots \\
z^k & = x^k - \sum_{i=1}^{k-1} \braket{\hat{z}^i}{x^k}\hat{z}^k \\
\end{aligned}

Where $\hat{z}^i =  \frac{z^i}{\Vert z^i \Vert}$

** Eigen-everything of Hermitian and anti-hermitian matrices

Eigenvalues of hermitian matrices are real

Eigenvalues of anti-hermitian matrices are pure imaginary (-$\lambda$)

To every hermitian operator, there exists at least a basis consisting of its orthonormal eigenvectors. It is diagonal in this eigenbasis and has its eigenvalues as its diagonal entries.

** Eigen-everything of unitary matrix

Eigenvalues of a unitary matrix have unit modulus and are complex.

Assuming no degeneracy, the eigenvectors of a unitary operator are mutually orthogonal

** Eigen-everything of a general square matrix

Any N x N matrix with distinct eigenvalues has N linearly independent eigenvectors.

If it has a degenerate eigenvalues, however, then it may or may not have N linearly independent eigenvectors.

Not having linearly independent eigenvectors makes it *defective*

** Simultaneous eigenvectors

Two different normal matrices have a common set of eigenvectors that diagonalises them both if and only if they commute

If an eigenvalue of A is degenerate then not all of its possible sets of eigenvectors will also constitute a set of eigenvectors of B. i.e. If B is nondegenerate but A is degenerate, then all eigenvectors of B are eigenvectors of A.

** Determination

Chracteristic function:
c(lambda) = det | A - lambda I |
Characteristic equation:

\[
\vert A - \lambda I \vert = 0
\]

LHS is the characteristic/secular determinant of A


When the determinant is written as a polynomial equation in $\lambda$, the coefficient of $-\lambda^{N-1}$ will be Tr A, i.e. the sum of the roots (recall p+q = -b/a, pq = c/a)

