exports/math/linear_algebra.html

<div id="outline-container-org692765d" class="outline-3">
<h3 id="org692765d"><span class="section-number-3">4.2</span> Projectors</h3>
<div class="outline-text-3" id="text-4-2">
<p>
A class of Hermitian operators. Let W be a k-dimensional vector subspace of the d-dimensional vector space V. Using Gram-Schmidt procedure it is possible to construct an orthonormal basisc for V (|1&gt;,&#x2026;,|d&gt;)such that |1&gt;,&#x2026;,|k&gt; is an orthonormal basis for W. The projector by defintion:
</p>

<p>
\[
P \equiv \sum_{i=k}^k \ket{i} \bra{i}
\]
</p>

<p>
\[
(P_i)_{kl} = \delta_{kl}\delta_{li}
\]
</p>

<p>
The orthogonal complement of P is Q = I - P, which is a projector onto the vector space spanned by |k+1&gt;&#x2026;|d&gt;
</p>

<p>
\[
P_i P_j = \delta_{ij} P_j
\]
</p>

<p>
Note that P<sup>2</sup> = P
</p>
</div>
</div>
</div>

<div id="outline-container-org8cbecec" class="outline-2">
<h2 id="org8cbecec"><span class="section-number-2">5</span> Operators</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org5b8e9b7" class="outline-3">
<h3 id="org5b8e9b7"><span class="section-number-3">5.1</span> Commutator</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Definition:
</p>

<p>
\[
\Omega \Lambda - \Lambda\Omega \equiv [\Omega,\Lambda]
\]
</p>

<p>
Identities:
</p>

<p>
\[
[\Omega,\Lambda] = \Lambda[\Omega,\theta] + [\Omega,\Lambda]\theta
\]
</p>

<p>
\[
[\Lambda\Omega,\theta] = \Lambda[\Omega,\theta] + [\Lambda,\theta]\Omega
\]
</p>
</div>
</div>

<div id="outline-container-orge4143b4" class="outline-3">
<h3 id="orge4143b4"><span class="section-number-3">5.2</span> Diagonalisable</h3>
<div class="outline-text-3" id="text-5-2">
<p>
A diagonal representation for an operator A on vector space V is a representation:
</p>

<p>
\[
A = \sum_i \lambda_i \ket{i}\bra{i}
\]
with corresponding eigenvalues \(\lambda_i\)
</p>

<p>
An operator is diagonalisable is it has a diagonal representation.
</p>

<p>
Any normal operator M on a vector space V is diagonal wrt some orthonormal basis for V. Also any diagonalisable operator is normal
</p>
</div>
</div>

<div id="outline-container-org4d9f053" class="outline-3">
<h3 id="org4d9f053"><span class="section-number-3">5.3</span> Active and passive transformations</h3>
<div class="outline-text-3" id="text-5-3">
<p>
If all vectors in a space are subject to a unitary transform (<b>Active Transformation</b>)
</p>

<p>
\[
\ket{V} \to U\ket{V}
\]
Then the same change would be effected if subjected operators to the change (<b>Passive Transformation</b>)
\[
\Omega \to U^\dagger\Omega U
\]
</p>
</div>
</div>
</div>

<div id="outline-container-orgcd69d74" class="outline-2">
<h2 id="orgcd69d74"><span class="section-number-2">6</span> Eigenvectors and eigenvalues</h2>
<div class="outline-text-2" id="text-6">
<p>
\[
Ax = \lambda x
\]
</p>


<p>
\[
A^{-1}x^i = \frac{1}{\lambda_i}x_i
\]
</p>

<p>
The eigenspace corresponding to a eigenvalue v is the set of vectors with eigenvalue v
</p>
</div>

<div id="outline-container-org6cb6721" class="outline-3">
<h3 id="org6cb6721"><span class="section-number-3">6.1</span> Normal matrices:</h3>
<div class="outline-text-3" id="text-6-1">
<p>
\[
A^\dagger x^i = \lambda_i^\ast x^i
\]
</p>

<p>
If \(\lambda_i \neq \lambda_j\), the eigenvectors \(x^i\) and \(x^j\) must be orthogonal
</p>


<p>
An eigenvalue corresponding to two or more different eigenvectors (i.e. they are not multiples) are <b>degenerate</b>. or in other words the <b>eigenspace</b> has more than 1 dimensions
</p>

<p>
Suppose \(\lambda_1\) is k-fold degenerate (for x<sup>1</sup> to x<sup>k</sup>), then any linear combination of those x<sup>1</sup> also has an eigenvalue of \(\lambda_1\)
</p>
</div>
</div>


<div id="outline-container-org244d2ea" class="outline-3">
<h3 id="org244d2ea"><span class="section-number-3">6.2</span> Gram-Schmidt orthogonalisation</h3>
<div class="outline-text-3" id="text-6-2">
\begin{aligned}
z^1 & = x^1, \\
z^2 & = x^2 - \braket{\hat{z}^1}{x^2} \hat{z}^1, \\
z^3 & = x^3 - \braket{\hat{z}^2}{x^3} \hat{z}^2 - \braket{\hat{z}^1}{x^3} \hat{z}^1, \\
 & \ldots \\
z^k & = x^k - \sum_{i=1}^{k-1} \braket{\hat{z}^i}{x^k}\hat{z}^k \\
\end{aligned}

<p>
Where \(\hat{z}^i =  \frac{z^i}{\Vert z^i \Vert}\)
</p>
</div>
</div>

<div id="outline-container-org4e8058b" class="outline-3">
<h3 id="org4e8058b"><span class="section-number-3">6.3</span> Eigen-everything of Hermitian and anti-hermitian matrices</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Eigenvalues of hermitian matrices are real
</p>

<p>
Eigenvalues of anti-hermitian matrices are pure imaginary (-\(\lambda\))
</p>

<p>
To every hermitian operator, there exists at least a basis consisting of its orthonormal eigenvectors. It is diagonal in this eigenbasis and has its eigenvalues as its diagonal entries.
</p>
</div>
</div>

<div id="outline-container-orgc9af4c0" class="outline-3">
<h3 id="orgc9af4c0"><span class="section-number-3">6.4</span> Eigen-everything of unitary matrix</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Eigenvalues of a unitary matrix have unit modulus and are complex.
</p>

<p>
Assuming no degeneracy, the eigenvectors of a unitary operator are mutually orthogonal
</p>
</div>
</div>

<div id="outline-container-orgb5733c4" class="outline-3">
<h3 id="orgb5733c4"><span class="section-number-3">6.5</span> Eigen-everything of a general square matrix</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Any N x N matrix with distinct eigenvalues has N linearly independent eigenvectors.
</p>

<p>
If it has a degenerate eigenvalues, however, then it may or may not have N linearly independent eigenvectors.
</p>

<p>
Not having linearly independent eigenvectors makes it <b>defective</b>
</p>
</div>
</div>

<div id="outline-container-org5742db8" class="outline-3">
<h3 id="org5742db8"><span class="section-number-3">6.6</span> Simultaneous eigenvectors</h3>
<div class="outline-text-3" id="text-6-6">
<p>
Two different normal matrices have a common set of eigenvectors that diagonalises them both if and only if they commute
</p>

<p>
If an eigenvalue of A is degenerate then not all of its possible sets of eigenvectors will also constitute a set of eigenvectors of B. i.e. If B is nondegenerate but A is degenerate, then all eigenvectors of B are eigenvectors of A.
</p>
</div>
</div>

<div id="outline-container-org92b0bbe" class="outline-3">
<h3 id="org92b0bbe"><span class="section-number-3">6.7</span> Determination</h3>
<div class="outline-text-3" id="text-6-7">
<p>
Chracteristic function:
c(lambda) = det | A - lambda I |
Characteristic equation:
</p>

<p>
\[
\vert A - \lambda I \vert = 0
\]
</p>

<p>
LHS is the characteristic/secular determinant of A
</p>


<p>
When the determinant is written as a polynomial equation in \(\lambda\), the coefficient of \(-\lambda^{N-1}\) will be Tr A, i.e. the sum of the roots (recall p+q = -b/a, pq = c/a)
</p>
</div>
</div>
</div>
