math/linear_algebra.org
* Change in basis

Given S where:

\[
x_i = \sum_{j=1}^N S_{ij}x'_j
\]

\[
x = Sx'
\]

where S is the transformation matrix associated with the change in basis

and

\[
x' = S^{-1} x
\]


The components of x transform *inversely* to how the basis vectors transform, as the vector x itself much remain unchanged

This applies to linear operators of x:

\[
y = Ax, y' = A'x'
\]

=>

\[
y' = S^{-1}ASx'
\]

or in other words:

\[
A' = S^{-1}AS
\]

which is an example of a similarity transformation


So any property of A which represents some basis independent property of its linear operator will be shared by A'

1. If A = I, A' = I
2. |A| = |A'|
3. Eigenvalues are the same
4. Trace is unchanged


** Unitary S

1. If the original basis is orthonormal and S is unitary then the new basis is also orthonormal
2. If A is (anti) hermitian then A' is (anti) hermitian
3. If A is unitary then A' is also unitary
* Diagonalisation of matrices

Define a basis $x^j$ given by:
\[
x^j = \sum_{i=1}^N S_{ij}{\bf e_i},
\]

where $x^j$ are chosen to be the eigenvectors of the linear operator $\mathcal{A}$.
i.e.

\[
\mathcal{A} x^j = \lambda_j x^j
\].

In our new basis, $\mathcal{A}$ is represented by the matrix $A' = S^{-1}AS$. The columns of S are the eigenvectors of the matrix A, i.e. $S_{ij} = (x^j)_i$. Therefore, A' is diagonal with the eigenvalues of $\mathcal{A}$ as the diagonal elements.

Since we require S to be non-singular, the N eigenvectors of A must be linearly independent and form a basis for the N-dimensional vector space. Any matrix with distinct eigenvalues can be diagonalised by this procedure. If it doesn't have N linearly independent eigenvectors, then it cannot be diagaonlised.

For normal matrices, the N eigenvectors are indeed linearly independent. For them, S is unitary.

Note:

\[
\det \exp A = \exp(\Tr A)
\]
* Infinite dimensions


** Dirac delta

In infinite dimensions,

\[
\braket{x}{x'} = \delta(x-x')
\]

\[
\delta '(x-x') = \delta(x-x')\dv{x}
\]

Dirac delta with fourier transform

\[
\delta(x-x') = \frac{1}{2\pi}\int_{-\infty}^\infty e^{ik(x-x')}\dd{k}
\]

\[
\delta(f(x)) = \sum_i \frac{\delta(x_i-x)}{|\dv{f}{x_i}|}
\]
where x_i are the zeros of f(x)

** Operators
*** Differential operator

\[
D\ket{f} = \ket{\dv{f}{x}}
\]

implies

In the |x> basis,
\[
\bra{x}D\ket{x'} = D_{x,x'}=\delta'(x-x')=\delta(x-x')\dv{x'}
\]

where it is integrated over the second index (x') and pulls out the derivative of f at the first index (x).

We can turn it hermitian by turning it into the form:

\[
K = -iD
\]

but in infinite dimensions, K^t = K is not sufficient to be hermitian. It is only hermitian in the space of functions that obey:


\[
-ig^*(x)f(x) | \given_a^b = 0
\]

so that <g|K|f> = <f|K|g>*.

**** eigeneverything

X-basis

\[
K\ket{k} = k\ket{k}
\]

\[
-i\dv{x}\psi_k(x) = k\psi_k(x)
\]

where $\psi_k(x) = \braket{x}{k}$.

the solution is:

\[
\psi_k(x) = Ae^{ikx}
\]

where we choose $A = (1/2\pi)^{-1/2}$

and <k|k>

*** X basis

X|x> = x|x>

\[
\bra{x'}X\ket{x} = x\delta(x'-x)
\]

Action on functions:

X|f> = |F>

F(x) = xf(x)

\[
\bra{k}X\ket{k'} = i\delta'(k-k')
\]

[X,K] = iI
