exports/math/linear_algebra.html

<div id="outline-container-org94f6e9b" class="outline-2">
<h2 id="org94f6e9b"><span class="section-number-2">7</span> Change in basis</h2>
<div class="outline-text-2" id="text-7">
<p>
Given S where:
</p>

<p>
\[
x_i = \sum_{j=1}^N S_{ij}x'_j
\]
</p>

<p>
\[
x = Sx'
\]
</p>

<p>
where S is the transformation matrix associated with the change in basis
</p>

<p>
and
</p>

<p>
\[
x' = S^{-1} x
\]
</p>


<p>
The components of x transform <b>inversely</b> to how the basis vectors transform, as the vector x itself much remain unchanged
</p>

<p>
This applies to linear operators of x:
</p>

<p>
\[
y = Ax, y' = A'x'
\]
</p>

<p>
=&gt;
</p>

<p>
\[
y' = S^{-1}ASx'
\]
</p>

<p>
or in other words:
</p>

<p>
\[
A' = S^{-1}AS
\]
</p>

<p>
which is an example of a similarity transformation
</p>


<p>
So any property of A which represents some basis independent property of its linear operator will be shared by A'
</p>

<ol class="org-ol">
<li>If A = I, A' = I</li>
<li>|A| = |A'|</li>
<li>Eigenvalues are the same</li>
<li>Trace is unchanged</li>
</ol>
</div>


<div id="outline-container-org66f4b5f" class="outline-3">
<h3 id="org66f4b5f"><span class="section-number-3">7.1</span> Unitary S</h3>
<div class="outline-text-3" id="text-7-1">
<ol class="org-ol">
<li>If the original basis is orthonormal and S is unitary then the new basis is also orthonormal</li>
<li>If A is (anti) hermitian then A' is (anti) hermitian</li>
<li>If A is unitary then A' is also unitary</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgc9cb5c6" class="outline-2">
<h2 id="orgc9cb5c6"><span class="section-number-2">8</span> Diagonalisation of matrices</h2>
<div class="outline-text-2" id="text-8">
<p>
Define a basis \(x^j\) given by:
\[
x^j = \sum_{i=1}^N S_{ij}{\bf e_i},
\]
</p>

<p>
where \(x^j\) are chosen to be the eigenvectors of the linear operator \(\mathcal{A}\).
i.e.
</p>

<p>
\[
\mathcal{A} x^j = \lambda_j x^j
\].
</p>

<p>
In our new basis, \(\mathcal{A}\) is represented by the matrix \(A' = S^{-1}AS\). The columns of S are the eigenvectors of the matrix A, i.e. \(S_{ij} = (x^j)_i\). Therefore, A' is diagonal with the eigenvalues of \(\mathcal{A}\) as the diagonal elements.
</p>

<p>
Since we require S to be non-singular, the N eigenvectors of A must be linearly independent and form a basis for the N-dimensional vector space. Any matrix with distinct eigenvalues can be diagonalised by this procedure. If it doesn't have N linearly independent eigenvectors, then it cannot be diagaonlised.
</p>

<p>
For normal matrices, the N eigenvectors are indeed linearly independent. For them, S is unitary.
</p>

<p>
Note:
</p>

<p>
\[
\det \exp A = \exp(\Tr A)
\]
</p>
</div>
</div>
<div id="outline-container-org075087c" class="outline-2">
<h2 id="org075087c"><span class="section-number-2">9</span> Infinite dimensions</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgfc7401a" class="outline-3">
<h3 id="orgfc7401a"><span class="section-number-3">9.1</span> Dirac delta</h3>
<div class="outline-text-3" id="text-9-1">
<p>
In infinite dimensions,
</p>

<p>
\[
\braket{x}{x'} = \delta(x-x')
\]
</p>

<p>
\[
\delta '(x-x') = \delta(x-x')\dv{x}
\]
</p>

<p>
Dirac delta with fourier transform
</p>

<p>
\[
\delta(x-x') = \frac{1}{2\pi}\int_{-\infty}^\infty e^{ik(x-x')}\dd{k}
\]
</p>

<p>
\[
\delta(f(x)) = \sum_i \frac{\delta(x_i-x)}{|\dv{f}{x_i}|}
\]
where x<sub>i</sub> are the zeros of f(x)
</p>
</div>
</div>

<div id="outline-container-org3164eb0" class="outline-3">
<h3 id="org3164eb0"><span class="section-number-3">9.2</span> Operators</h3>
<div class="outline-text-3" id="text-9-2">
</div>
<div id="outline-container-orgd361d86" class="outline-4">
<h4 id="orgd361d86"><span class="section-number-4">9.2.1</span> Differential operator</h4>
<div class="outline-text-4" id="text-9-2-1">
<p>
\[
D\ket{f} = \ket{\dv{f}{x}}
\]
</p>

<p>
implies
</p>

<p>
In the |x&gt; basis,
\[
\bra{x}D\ket{x'} = D_{x,x'}=\delta'(x-x')=\delta(x-x')\dv{x'}
\]
</p>

<p>
where it is integrated over the second index (x') and pulls out the derivative of f at the first index (x).
</p>

<p>
We can turn it hermitian by turning it into the form:
</p>

<p>
\[
K = -iD
\]
</p>

<p>
but in infinite dimensions, K<sup>t</sup> = K is not sufficient to be hermitian. It is only hermitian in the space of functions that obey:
</p>


<p>
\[
-ig^*(x)f(x) | \given_a^b = 0
\]
</p>

<p>
so that &lt;g|K|f&gt; = &lt;f|K|g&gt;*.
</p>
</div>

<ol class="org-ol">
<li><a id="orgcbc86da"></a>eigeneverything<br />
<div class="outline-text-5" id="text-9-2-1-1">
<p>
X-basis
</p>

<p>
\[
K\ket{k} = k\ket{k}
\]
</p>

<p>
\[
-i\dv{x}\psi_k(x) = k\psi_k(x)
\]
</p>

<p>
where \(\psi_k(x) = \braket{x}{k}\).
</p>

<p>
the solution is:
</p>

<p>
\[
\psi_k(x) = Ae^{ikx}
\]
</p>

<p>
where we choose \(A = (1/2\pi)^{-1/2}\)
</p>

<p>
and &lt;k|k&gt;
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgde2d273" class="outline-4">
<h4 id="orgde2d273"><span class="section-number-4">9.2.2</span> X basis</h4>
<div class="outline-text-4" id="text-9-2-2">
<p>
X|x&gt; = x|x&gt;
</p>

<p>
\[
\bra{x'}X\ket{x} = x\delta(x'-x)
\]
</p>

<p>
Action on functions:
</p>

<p>
X|f&gt; = |F&gt;
</p>

<p>
F(x) = xf(x)
</p>

<p>
\[
\bra{k}X\ket{k'} = i\delta'(k-k')
\]
</p>

<p>
[X,K] = iI
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-08-16 Mon 17:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
